import React from 'react';
import axios from 'axios';
import Header from './Header';
import Footer from './Footer';


class GoodLuck extends React.Component {
  componentDidMount() {
    this.defaultLanguage = 'en';

    this.backgroundId = this.props.match.params.backgroundId || 1;
    this.language = this.props.match.params.language || this.defaultLanguage;
    this.quote = this.getDailyQuote(this.language, this.backgroundId, this.props.match.params.qr);

    this.setState({
      quote: this.quote
    });
  }

  constructor() {
    super();
    this.state = {
      quote: ''
    }
  }

  getDailyQuote(language, backgroundId, qr) {
    let quote = '';

    if (language && qr) {
      quote = this.getQuote(language, qr);
      if (!quote) {
        quote = this.getRandomQuote(language);
      }
    } else {
      if (!language) {
        axios.get('https://ipapi.co/json/').then((response) => {
          let data = response.data;
          language = data?.country_code;
        }).catch((error) => {
          console.log(error);
          language = this.defaultLanguage;
        }).finally(() => {
          quote = this.getRandomQuote(language);
        });
      } else {
        quote = this.getRandomQuote(language);
      }
    }

    return quote;
  }

  getRandomQuote(language) {
    let localQuotes = QuotesCache[`${language.toLowerCase()}`];
    let quote = '';

    if (!localQuotes || localQuotes.length <= 0) {
      console.log(`Unsupported language. Falling back to: ${this.defaultLanguage}`);
      localQuotes = QuotesCache[`${this.defaultLanguage.toLowerCase()}`];
    }

    quote = localQuotes[Math.floor(Math.random() * localQuotes.length)];

    if (!quote) {
      throw "The random quote is empty";
    }

    return quote;
  }

  getQuote(language, qr) {
    let quote = QuotesCache[`${language.toLowerCase()}`].find(i => i.id == qr)

    if (!quote) {
      console.log('Falling to random quote');
      quote = this.getRandomQuote(language);
    }

    return quote;
  }

  render() {
    if (!this.state.quote) {
      return null;
    }
    

    return (
      <>
        <Header />
        <div>
          <h1>Quote: {this.quote.text} | Background: {this.backgroundId}</h1>
        </div>
        <Footer />
      </>)
  }
}

export default GoodLuck;

var QuotesCache = {
  "bg": [{
    id: 'eeb3bb971d7c41e08684c358b93b0a32',
    text: `Пропускаш 100% от възможностите, които не предприемаш
    - Уейн Грецки`
  },
  {
    id: '9b45a7d2655d408bbe2ec65b8ddee51f',
    text: `Ако не правиш грешки, значи не се опитваш истински`
  },
  {
    id: '4d14241d423e43d3a3a3249323374981',
    text: `Силата не идва от физическия капацитет. Тя идва от неукротимата воля
    - Махамата Ганди`
  },
  {
    id: '1bff76efadaa4ed6a35ab0e7c0e634b3',
    text: `По-добре да не успя в нещо, което харесвам, от колкото да успея в нещо, което мразя
    - Джордж Бърнс`
  },
  {
    id: 'ffcdbc7cfee9482a9fb99a1adafc4ea2',
    text: `Нито една проява на доброта, дори най-малката, не е загуба на време
    - Езоп`
  },
  {
    id: '4e088521f639427a8ec4e0827cd39523',
    text: `Умението е това, на което си способен. Мотивацията определя това, което правиш. Отношението определя колко добре го правиш. 
    - Луи Холц`
  },
  {
    id: 'a5794bf74724421e9c4dbb2d05416d04',
    text: `Мотивацията те кара да започнеш. Навикът е това, което те поддържа да продължаваш
    - Джим Раян`
  },
  {
    id: '2d9f9b36b1764a0d8c3f6243e8fec9c8',
    text: `Страхът е този, който те спира... куражът е този, който да кара да вървиш напред`
  },
  {
    id: 'edc399ecdabb4d579713ba3d46e597b8',
    text: `В правенето на другите хора щастливи, ние намираме и нашето щастие`
  },
  {
    id: 'b617d1c0dcea4fbd90289797ce337b12',
    text: `Позитивизмът се просмуква навсякъде, както и водата. 
    Негативизмът се разпространява по-бързо, подобно на огън`
  },
  {
    id: '7fe84c2d83cb4e0ca7c4a4417c1e25a0',
    text: `Неуспехът не е признак на лична некомпетентност. Това е само един експеримент, който не се е получил. 
    Имайте смелостта да минете на следващото ниво.`
  },
  {
    id: '41eccaa384fd45ddad8ff4519944d3c7',
    text: `Не си струва да се подчинявате на фактите.
    Имате правото да бъдете изключение от правилото.`
  },
  {
    id: '2e0eab49a6bd4f44a248c1367380d118',
    text: `Да пристигнеш последен е по-добре, отколкото да не финишираш`
  },
  {
    id: '3449190136824c61a60835dd7c15fd04',
    text: `Имате три варианта, измежду които да избирате в живота: 
    да се предадете, да не се предадете или да направите всичко, за да постигнете желаното.`
  },
  {
    id: '512d231a3eb94d339960f423286ce7a2',
    text: `Това, което правите всеки ден, има по-голямо значение, 
    отколкото онова, което смятате да направите в скоро време.`
  },
  {
    id: '5870a34100e44411b6f0fdb3d2e38e3b',
    text: `Ако нямате ясна цел, винаги ще се разсейвате`
  },
  {
    id: 'bbea69ace4fa4a428b5a77632f96ae4d',
    text: `"След година ще съжалявате, че не сте започнали днес
    - Карън Лемб"`
  },
  {
    id: '4cb62682f6e3439288c6c1e4a2c3f92a',
    text: `Любовта не се изразява в това да се взираме един в друг, а да гледаме в една и съща посока. 
    – Антоан дьо Сент Екзюпери`
  },
  {
    id: '7274aca4d4fa4f0dae4c703956de7913',
    text: `Бъдещето зависи от това, какво правим в момента. 
    – Махатма Ганди`
  },
  {
    id: '018c25db724d4d338451e2c64a65c29f',
    text: `Само слабите се стремят към порядък. Силните владеят хаоса.`
  },
  {
    id: 'a4d15e44bb76460b86fa7d25c2adda1f',
    text: `Свободата се полага само на този, който може да поеме отговорностите, които тя носи.`
  },
  {
    id: '332527de2daa41bb906d30433a3a8fc3',
    text: `Мисли! Вярвай! Мечтай! Рискувай! – Уолт Дисни`
  },
  {
    id: '3b88895523194f60b1e7aca60807bd04',
    text: `Стремете се към прогрес, не към съвършенство.`
  },
  {
    id: '44a1d6b2df7c49ab8afb6a750adff8ba',
    text: `Човек може да постигне всичко, стига да повярва в него.
    - Наполеон Хил`
  },
  {
    id: 'a842ab847ca24ec785f2dbb9c8f879c8',
    text: `Най-трудно е да вземеш решение да действаш. Оттам нататък просто трябва да си упорит. 
    - Амелия Ерхарт`
  },
  {
    id: 'c6646847c5b64a138779b2fa955c46d0',
    text: `След 20 години ти ще бъдеш по-разочарован от това, което не си направил, 
    отколкото от нещата, които си направил. Затова опъни платната, 
    напусни сигурното пристанище, улови вятъра! Изследвай! Мечтай! Откривай! 
    - Марк Твен`
  },
  {
    id: 'ca96484e1c0f44e3a6d64bdf545932b6',
    text: `Никога няма да прекосиш океана, ако нямаш куража да се откъснеш от брега. 
    - Христофор Колумб`
  },
  {
    id: '10362276bf5542f5bad26f482570c4c6',
    text: `Единственият човек, който е писано да бъдеш, е човекът, който ти решиш да бъдеш. 
    - Ралф Уалдо Емерсън`
  },
  {
    id: 'a3028121cf894a17a0184af8f590eed4',
    text: `Успехът се дължи на много неща - на късмет, на упорита работа, на подкрепа и съвети от приятелите. 
    Но най-вече се дължи на едно нещо - да продължиш да ставаш, след като си паднал. 
    - Марк Уорнър`
  },
  {
    id: 'd914411097c94262838556e436cf9e55',
    text: `Изгради мечтите си или някой ще те наеме да изграждаш неговите мечти. 
    - Фара Грей`
  },
  {
    id: '409076f5f6c44ae1ace198a7c23c287e',
    text: `Когато ти се струва, че всичко е срещу теб, спомни си, че самолетът излита срещу вятъра, а не с него. 
    - Хенри Форд`
  },
  {
    id: '4181db92cd9048a8aec6c80e1d8315bb',
    text: `Да печелиш е прекрасно, но ако наистина искаш да направиш нещо стойностно с живота си, трябва да се научиш да губиш. 
    Никой не е непобедим през цялото време. Ако можеш да се изправиш след съкрушителна загуба, значи вече си шампион. 
    – Уилна Рудолф`
  },
  {
    id: '4a4bebf45c6f4866bf5a8336c9bcb654',
    text: `Важно е да празнуваш успеха, но по-важно е да обърнеш внимание на уроците от неуспеха. 
    – Бил Гейтс`
  },
  {
    id: '33908e8101e6415da5967de2b4b32fe9',
    text: `Понякога, когато загубиш битката, откриваш начин да спечелиш войната. 
    – Доналд Тръмп`
  },
  {
    id: '9a53830f3efa413e90ee0b72858b9c03',
    text: `Провалът се случва непрекъснато, на практика всеки ден. Това, което те прави по-добър, е как реагираш на него. 
    – Миа Хам`
  },
  {
    id: 'caad11c5dc494d92bb2015dbd6b0d8ed',
    text: `Удoвoлcтвиeтo oт paбoтaтa вoди дo cъвъpшeнcтвo в нeя. 
    - Apиcтoтeл`
  },
  {
    id: '3d2c04c679ae453fb7fc82c70a5796a3',
    text: `Aĸo нe cи нaмepил твoeтo нeщo, пpoдължaвaй дa тъpcиш. He ce пpимиpявaй!
    Kaĸтo c вcичĸo ocтaнaлo, cвъpзaнo cъc cъpцeтo, ĸaтo гo нaмepиш, щe paзбepeш, чe e тoвa. 
    И ĸaтo вcяĸa чyдecнa вpъзĸa cтaвa пo-дoбpe и пo-дoбpe c нaпpeдвaнeтo нa вpeмeтo. 
    - Стив Джобс`
  },
  {
    id: '6f09061bbf0346ca858a623af5241ee5',
    text: `Започни да правиш това, което най-много желаеш, още сега. Животът няма да трае цяла вечност. 
    Имаш само този момент, белщукащ като звезда в ръката ти, и след това разтапящ се като снежинка. 
    – Сър Френсис Бейкън`
  },
  {
    id: '782bcb521e644cdbb4d0d55381c8339c',
    text: `Човек, който се доверява на хората ще направи по-малко грешки от човека, който не вярва в тях. 
    – Кавур`
  },
  {
    id: 'e3af7c31ff4a4cea9f520f566619acab',
    text: `Любовта е като свиренето на пиано. Първо трябва да се научиш да свириш, следвайки правилата, а след това трябва да забравиш правилата и да свириш със сърцето си`
  },
  {
    id: 'a98e6824032a4584a88eb3fdc6885385',
    text: `Простотата на живота не означава, че трябва да бъде прекаран в бедност и мизерия. 
    Достатъчно е да имаш това, от което се нуждаеш, и да не искаш това, от което не се нуждаеш. 
    – Чаран Синг`
  },
  {
    id: '945183ddb73945fb81e5efd398687a63',
    text: `Трите най-съществени елемента на щастието са: нещо, което да правиш; някой, който да обичаш; нещо, в което да вярваш. 
    – Александър Чалмърс`
  },
  {
    id: '9b77fc70d47d416e955e54979971a5d9',
    text: `Ако искате да имате сила в света, най-напред станете господари на себе си и не бързайте да подчинявате хората. 
    Ако станете господари на себе си, много хора ще ви последват.`
  },
  {
    id: '0735eb0c00be43eaa9e51bee573e1c0e',
    text: `Започва един прекрасен ден, който ще бъде по-прекрасен от вчерашния`
  },
  {
    id: '18d896c267c5400da70e28e20502a018',
    text: `Не избирай този, когото светът смята за красив. Избери този, който прави света ти красив`
  },
  {
    id: '5f8f9b440b124903a70c6e020975b3a4',
    text: `Работи, сякаш не ти трябват пари! Танцувай, сякаш никой не те гледа! Обичай, сякаш никога не си бил нараняван`
  },
  {
    id: '96800ef5cd9f4ae8b911c519c5652246',
    text: `Има два начина да изживееш живота си. Единият е като мислиш, че не съществуват чудеса. Другият е, като мислиш, че всяко нещо е чудо
    - Алберт Айнщайн`
  },
  {
    id: '1c7525637dd4411e93322d9761bb0ab0',
    text: `Ако животът ти поднесе лимон, направи си лимонада. 
    - Махариши Махеш Йога`
  },
  {
    id: '43398307671a4cb2997424dd4b9fa6ca',
    text: `Вечно съм на 18! Другото е стаж.`
  },
  {
    id: 'aebbf759f33447a393e866b913589adc',
    text: `Големите неща се състоят от поредица от малки неща, които са събрани заедно.
    - Винсент Ван Гог`
  },
  {
    id: 'ec9aad2ec1884c0482d37b65e4003b1a',
    text: `Предизвикателствата са това, което прави живота интересен. Преодоляването им – това което прави живота смислен"" 
    – Джошуа Марин`
  },
  {
    id: '2e2ea894a44a4c9881640cb9f8b60aae',
    text: `Хубавите неща се случват на онези, които умеят да чакат. Страхотните неща се случват на хората, които не чакат, а правят всичко възможно да ги получат.`
  },
  {
    id: '7120b008f0cc4c338d4051bbfed48052',
    text: `Щастието не може да бъде пропътувано, спечелено, носено или притежавано. 
    То е вътрешното чувство, което има човек, когато живее изпълнен с любов и благодарност всеки ден "" 
    – Денис Уайтли`
  },
  {
    id: 'ba77b479ddfa4077a05d6e9ed9a5c5a1',
    text: `Не се страхувай да застанеш зад това, в което вярваш, дори това да значи да застанеш сам."" 
    – Анди Биерсак`
  },
  {
    id: 'e3b1489a46ed48afaec7ba4b5af269e9',
    text: `Единственият начин да вършиш велики дела е като правиш онова, което обичаш. Ако още не си го открил, не спирай да го търсиш. Не се задоволявай с по-малко.
    – Стив Джобс`
  },
  {
    id: 'dbbe85f2ec644bd5925eb247ea2abbe5',
    text: `Животът е като фотография. Имаш нужда от негативите, за се развиваш. Не се плаши от провалите. Плаши се от възможностите, които не си поел, когато си имал шанс`
  },
  {
    id: '263463c3f7b1472bace1e6fc810c00ae',
    text: `Работи върху своите собствени мечти или някой друг ще те наеме да работиш за неговите"" 
    – Фара Грей`
  },
  {
    id: '0bd37a987aab4bebb241a4b7ac0cbb7c',
    text: `Самочувствието е най-привлекателната черта в един човек. Как някой друг ще види, че си страхотен, ако ти самият не го виждаш?`
  },
  {
    id: '11fa531e000f4ca58c3fc7acffc6ddd3',
    text: `Три са нещата, които не можеш да върнеш в живота си: Думата, след като е казана, моментът, след като е изпуснат и времето, след като си е отишло`
  },
  {
    id: 'fa5db4795181479eadb8511155c9caca',
    text: `И въпреки че не можеш да се върнеш назад и да си осигуриш ново начало, можеш да започнеш от днес и да си осигуриш изцяло нов край
    – Карл Бард`
  },
  {
    id: 'e68f6aec50a149449f4971b53efb0591',
    text: `Запомни, някъде там има някой, който е щастлив с по-малко от това, което ти имаш`
  },
  {
    id: '217d83acca57411495abbb5a3904496a',
    text: `Никой няма да дойде и да ти даде успеха. Трябва да дойдеш и да си го вземеш сам !`
  },
  {
    id: 'ad8a843fea98498f9183c7cb916d95f3',
    text: `Всеки човек умира, но не всеки човек наистина живее.
    - Алексис Сидерис`
  },
  {
    id: '10713c256ce243b6b2e9efbed0c37e0f',
    text: `Ако натегнеш много струната - ще се скъса, ако я оставиш хлабава - няма да свири. Да се учиш - значи да се променяш. Линията на просветлението е Средният път - линията между противоположните крайности. 
    - Буда`
  },
  {
    id: '47e9696bccd74a33a53b04b731c3d5ea',
    text: `Беден е не този, който има малко, а този, който иска да има повече 
    - Сенека`
  },
  {
    id: 'd2d0bbad5b1b4632b8504623527d2d9c',
    text: `Щастието е като здравето - ако не го забелязваш, значи го имаш. 
    - Тургенев`
  },
  {
    id: 'c7695769f667496db040a288c340cf60',
    text: `Не губи безценни мигове от настоящата реалност, опитвайки се да разгадаваш тайните на живота. 
    Има причина тайните да бъдат тайни`
  },
  {
    id: '97916a1ef10c4f1c9c925aee50e6da8a',
    text: `Не е важно кой е прав, а какво е правилно
    - Томас Хексли`
  },
  {
    id: 'f60a4d0584214cbbbfb253ad552a0a79',
    text: `Човек трябва да иска малко, за да може да плати цената
    - Ванга`
  },
  {
    id: '52dd79ca4577493280eca8e491e16b1a',
    text: `Когато съдбата почука на вратата, не се прави че те няма в къщи`
  },
  {
    id: '0ad479d3bd654586b7ad2124a55941ac',
    text: `Скъпите неща не струват пари. Ако не получим това, което желаем - значи не сме платили цената
    -Алексис Сидерис`
  },
  {
    id: '12f22c2523fd4c26862f27d4f5e8208c',
    text: `Една верига не е по-силна от най-слабото си звено и ако дори само един от екипа не може да се справи, всички останали страдат. 
    - Дайън Форчън`
  },
  {
    id: '02ab234274a044609b0f85ed6f2ae8fa',
    text: `Няма ни добро, ни зло – тях ги създава нашата мисъл
    - Хамлет, Уилям Шекспир`
  },
  {
    id: 'e0f5609ccc2b44d993120f32f25313f3',
    text: `Воините-победители първо побеждават и после отиват на война, а губещите воини първо отиват на война и после се опитват да я спечелят.
    - Сън Цу`
  },
  {
    id: '4682eef51e0140e3a9e14721009933bd',
    text: `Най-великото откритие на всички времена е, че човек може да промени бъдещето си, като просто промени отношението си към живота.
    - Опра Уинфри`
  },
  {
    id: 'fbbde5832e77449ea8a722ef3ac75ee0',
    text: `Всеки път, когато сутрин отворя очи, си казвам: Аз, а не обстоятелствата, имам силата да се направя щастлив или нещастен днес. 
    Мога да избера едната от двете възможности. Вчера умря, утре още не е тук. Имам само един ден – днешният – и ще бъда щастлив в него
    - Гручо Маркс`
  },
  {
    id: 'f954b361591f4debbad93406beaf57c5',
    text: `Внимавай какво си пожелаваш, защото може и да се сбъдне
    - Алексис Сидерис`
  },
  {
    id: '6cf9d4d4c97e404893c31541ffc2f0e9',
    text: `Човек трябва да бъде достатъчно голям, за да признае грешките си, достатъчно умен, за да спечели от тях, и достатъчно силен, за да ги поправи.
    - Джон Максуел`
  },
  {
    id: 'b0ac32dcb17f410b97ef859bed7e731e',
    text: `Най-добрите и красиви неща на света не могат да бъдат видени, нито докоснати… те се усещат в сърцето
    - Хелън Келър`
  },
  {
    id: '2b4e94db06994b4784a83b5fc6186df5',
    text: `Има два начина да изживееш живота си. Единият е като мислиш, че не съществуват чудеса. Другият е като мислиш, че всяко нещо е чудо
    - Алберт Айнщайн`
  },
  {
    id: 'c709a079907142d0868c1b695c8e890b',
    text: `Който не цени живота, не го заслужава
    - Леонардо да Винчи`
  },
  {
    id: '3225fe1c89584e7fb76981df70455d68',
    text: `Никога не позволявай на един лош ден да те кара да мислиш, че имаш лош живот.`
  },
  {
    id: 'ec63d92f22274dcc8758dcc44263bc5d',
    text: `Колкото повече обичаш решенията, които вземаш, толкова по-малко ще имаш нужда другите да ги обичат.`
  },
  {
    id: 'da34a368eb8148a087765d02b8ab7eda',
    text: `Ако си доволен от всичко, никога няма да разбереш това, което наистина си заслужава.`
  },
  {
    id: '3196033323d14335954860dfe76effe5',
    text: ``
  },
  {
    id: '0bd37a987aab4bebb241a4b7ac0cbb7c',
    text: `Каквото и да ти е сторил някой в миналото, то няма власт над настоящето ти. 
    Ти си този, който му даваш сила и власт!`
  },
  {
    id: 'ed1b0c600a874af490ea309618736d8c',
    text: `Понякога хората захвърлят нещо добро за нещо по-добро. И по-късно разбират, че доброто всъщност е било достатъчно добро, а по-доброто никога не се е появило`
  },
  {
    id: 'b4b7a77985324f42b6ad9c83b6575b51',
    text: `Усмихни се, някой те обича :)
    Честит имен ден!
    - Алексис Сидерис`
  },
  {
    id: '64fe5f517c3b4931a6e73166ddcdcdac',
    text: `Ако са ти останали само две монети, похарчи едната за хляб, за да ти даде живот, 
    а другата похарчи за цвете, за да придадеш смисъл на този живот. 
    - Древна китайска поговорка`
  },
  {
    id: '28a07dd23fbd41d9b21984adeb15828a',
    text: `Човек никога не е нито тъй щастлив, нито тъй нещастен, 
    както си въобразява.
    - Франсоа дьо Ларошфуко`
  },
  {
    id: '19f0a6da2fda49679fdb2e51e20d324d',
    text: `Не си задавай въпроса от какво се нуждае светът. 
    Запитай се какво те кара да се чувстваш жив, излез и го направи. 
    Защото светът се нуждае от хора, които живеят истински. 
    – Харълд Уитман`
  },
  {
    id: '8e4433e37e1c4e75a0b748dddd1a1b79',
    text: `Единственото нещо, от което трябва да се страхуваме, 
    е самият страх. 
    - Франклин Рузвелт`
  },
  {
    id: '6052c3cfedfb41b7bd607836eabb1921',
    text: `Ако раят не е в тебе самият, 
    ти никога не ще влезеш в него. 
    - Силезиус`
  },{
    id: '79da42f5b3a9430385a3a208f18fec09',
    text: `Не трябва проблемите да ви тикат напред, 
    а мечтите да ви водят. 
    - Дъглас Евърет`
  },{
    id: 'c8babae255f14793af8097bc7a63bfab',
    text: `Нищо велико не е постигнато без ентусиазъм. 
    - Ралф Уолдо Емерсон`
  },
  {
    id: '00f54d78c58c474b80f41329f4e0eb5d',
    text: `Лудост: да правиш едно и също нещо отново и отново и да очакваш различни резултати. - Алберт Айнщайн`
  },
  {
    id: 'c6dd72c5d1d34ee88568ee0ac2c29cc6',
    text: `Пропуснал съм над 9,000 изстрела в кариерата си. Загубил съм почти 300 мача. 
    26 пъти ми се доверяваха да направя финалния и решаващ изстрел и съм пропускал. 
    Провалял съм се много пъти в живота си. 
    И точно заради това успях. 
    - Майкъл Джордан`
  },
  {
    id: 'ebdf2ffcb1704bc0b2f6d4ec4fd9730a',
    text: `Действай така, сякаш това, което правиш има значение. 
    Защото наистина има. 
    – Уилям Джеймс`
  },
  {
    id: '75b9469641ec43e6b6cb438c09900110',
    text: `Животът е като каране на колело. 
    За да поддържаш баланса, трябва да не спираш да се движиш напред. 
    – Алберт Айнщайн`
  },
  {
    id: '89aa25503a834c86adaf27ce688050f2',
    text: `Никога не се отказвай да правиш това, което искаш. 
    Там, където има любов и вдъхновение, няма начин да сгрешиш. 
    – Ела Фицджералд`
  },
  {
    id: '7205c96b59cc4a2586a1c169ca5a7d11',
    text: `Трябва да правиш именно нещата, 
    с които смяташ, че не можеш да се справиш. 
    – Елинор Рузвелт`
  },
  {
    id: 'c51cdf26b7264d79bb24b4f64d584765',
    text: `Успехът е да получите това, което искате. 
    Щастието е да искате това, което получавате. 
    – Дейл Карнеги`
  },
  {
    id: '2b2ddbe9072943b7ae7f71525e5d1e5d',
    text: `Човек може да постигне всичко, 
    стига да повярва в него. 
    - Наполеон Хил`
  },
  {
    id: '423281bec7ef4227825b06fedf46a508',
    text: `В гората имаше два пътя. Аз поех по по-малко познатия. 
    В това е разликата. 
    - Робърт Фрост`
  },
  {
    id: 'b773a7fbb6594504a88fda5d1db7872b',
    text: `Най-често хората се отказват от своята сила, 
    мислейки си, че не притежават такава. 
    - Алис Уокър`
  },
  {
    id: '492425825cb04d4fbff00ad34196840e',
    text: `Никога няма да прекосиш океана, 
    ако нямаш куража да се откъснеш от брега. 
    - Христофор Колумб`
  },
  {
    id: '349f3620da3849e3907a61a09217289b',
    text: `За всичко, което си мислиш, че можеш да направиш, 
    и за всичко, което си мислиш, че не можеш, си прав! 
    - Хенри Форд`
  },
  {
    id: '2bc7275297764812a7617d0bc0af91cf',
    text: `Да не получиш това, което искаш, 
    понякога е голям късмет. 
    - Далай Лама`
  },
  {
    id: 'e34b418af5074314b9cf467552c6614f',
    text: `Не е важно колко дълго си живял, 
    а как. 
    – Сенека`
  },
  {
    id: '60cf50f169874418aa6663408031df5f',
    text: `Какво правехте като дете, за да минават часовете ви като минути? 
    В това се крие ключът към земните ви занимания. 
    – Карл Юнг`
  },
  {
    id: 'f23d47dbcb2c403790881755a2a69914',
    text: `Стани този, който си. 
    –  Фредерик Ницше`
  },
  {
    id: '0211a36494ff4ae086f74f3907cdfe46',
    text: `Не се стремете да постигнете успех - опитайте се да намерите смисъл в живота. 
    - Алберт Айнщайн`
  }],
  "en": [
    {
      id: 'bc24118dd31348eea8f9628a2ba8972e',
      text: `If you believe it’ll work out, you’ll see opportunities. If you don’t believe it’ll work out, you’ll see obstacles. – Wayne Dyer`
    },
    {
      id: 'df388df97f5a4b4281cfc9743decb91a',
      text: `Keep your eyes on the stars, and your feet on the ground. – Theodore Roosevelt`
    },
    {
      id: 'ce9b037251fd4e608c79861e8e51c3b9',
      text: `You can waste your lives drawing lines. Or you can live your life crossing them. – Shonda Rhimes`
    },
    {
      id: '2ce77e199d124def8c90e32ddc6c74e2',
      text: `You’ve got to get up every morning with determination if you’re going to go to bed with satisfaction. – George Lorimer`
    },
    {
      id: 'd74f5df1030b4250b89b29745efe0d6d',
      text: `I now tried a new hypothesis: It was possible that I was more in charge of my happiness than I was allowing myself to be. – Michelle Obama`
    },
    {
      id: 'a7c4293248664df2bded37bb3d21c8c1',
      text: `In a gentle way, you can shake the world. – Mahatma Gandhi`
    },
    {
      id: 'ec5e4b94d652426b870b19dae582eab6',
      text: `If opportunity doesn’t knock, build a door. – Kurt Cobain`
    },
    {
      id: '53602e8ec1964f9a954a52226a4f5361',
      text: `Don’t be pushed around by the fears in your mind. Be led by the dreams in your heart. – Roy T. Bennett`
    },
    {
      id: '5032cd6a2875434293b749b89fe59e43',
      text: `Work hard in silence, let your success be the noise. – Frank Ocean`
    },
    {
      id: 'c86854507392459ab042cda4d16d3fc5',
      text: `No one is to blame for your future situation but yourself. If you want to be successful, then become Successful.― Jaymin Shah`
    },
    {
      id: 'bbc269407e634260b35aca895da22f13',
      text: `Things may come to those who wait, but only the things left by those who hustle.― Abraham Lincoln`
    },
    {
      id: '704e1e3487424a59a329cb03bc868e59',
      text: `Everything comes to him who hustles while he waits.― Thomas Edison`
    },
    {
      id: '884bb18c61e340d8a9e09e38e0839d32',
      text: `Every sucessful person in the world is a hustler one way or another. We all hustle to get where we need to be. Only a fool would sit around and wait on another man to feed him. ― K’wan`
    },
    {
      id: '3ba0e08fdbb649b1b5babebdba491dc9',
      text: `Invest in your dreams. Grind now. Shine later. – Unknown`
    },
    {
      id: '8fbeaa95b6344f05849ee3b14b2c76c5',
      text: `Hustlers don’t sleep, they nap. – Unknown`
    },
    {
      id: 'c273eeefc5d04224bc05d98a4e980e72',
      text: `Greatness only comes before hustle in the dictionary. – Ross Simmonds`
    },
    {
      id: '2ce0be3861bd43739febea1d8884a971',
      text: `Without hustle, talent will only carry you so far. – Gary Vaynerchuk`
    },
    {
      id: '44723434d34749d39551e7cb8b437f47',
      text: `Work like there is someone working twenty four hours a day to take it away from you. – Mark Cuban`
    },
    {
      id: '76ce0f3417814cbf8663fc63c72febb7',
      text: `Hustle in silence and let your success make the noise. – Unknown`
    },
    {
      id: 'ced2402b10a84ac3b6ab2021f979ae27',
      text: `Don’t say you don’t have enough time. You have exactly the same number of hours per day that were given to Helen Keller, Pasteur, Michelangelo, Mother Teresa, Leonardo Da Vinci, Thomas Jefferson, and Albert Einstein. – H. Jackson Brown Jr.`
    },
    {
      id: 'fe74407f200f46b08c728b8543ecd95d',
      text: ``
    },
    {
      id: 'a5b56ff2e4d045c5a96c50ac7c0448a2',
      text: ``
    },
    {
      id: '0a6e7ceb15a3482db3024577eb17a7e1',
      text: ``
    },
    {
      id: '54397b0688da4acba4a56ddcb52949af',
      text: ``
    },
    {
      id: 'd27de3922a874ec6bff30e56a38cfde6',
      text: ``
    },
    {
      id: '32898151fcb14219a1fe67026b48b6d1',
      text: ``
    },
    {
      id: '5e22a0388b214e5f98ce7a925ab8ce94',
      text: ``
    },
    {
      id: 'fb366ca2a7f84d9dadd52465db3f8e2a',
      text: ``
    },
    {
      id: 'cd85ff76262b4d6baa93320ca775595a',
      text: ``
    },
    {
      id: '09c9cf1c22d24a228b8e68f6b0e30a85',
      text: ``
    },
    {
      id: '2d376bff6da549ca80349f1d4ef6deb0',
      text: ``
    },
    {
      id: 'c96661181f1841fb8405e7b6b0b732cc',
      text: ``
    },
    {
      id: '47fe4063c74745e2b23063028777b942',
      text: ``
    },
    {
      id: 'e2756eac302d41a18d16adf36748b23e',
      text: ``
    },
    {
      id: '562423140b914502aa10dd9c6c656752',
      text: ``
    },
    {
      id: '2b3ac348da384602a530d83cf5051c2b',
      text: ``
    },
    {
      id: '4ced7bf7f84a427cafedad849406e1df',
      text: ``
    },
    {
      id: '3e710cea14b74e07ac13e113d1f0db0c',
      text: ``
    },
    {
      id: '66ce5f386f74414b9d60529ecaab8dd9',
      text: ``
    },
    {
      id: '4c90ae3a182a4a74a212f5442746f188',
      text: ``
    },
    {
      id: '66341146a07f408a822d2c1aee4fb794',
      text: ``
    },
    {
      id: '5abd4bfa7f7b46029e0809152fbbba54',
      text: ``
    },
    {
      id: 'ac2b812f2c8b43d88275f57ca93ed9ff',
      text: ``
    },
    {
      id: 'a14802bf92a647429cb531efdd536994',
      text: ``
    },
    {
      id: '8a41369346054620af7a152888c14be9',
      text: ``
    },
    {
      id: '88e432bc20964b1e8c3d4b9bad0bfaaa',
      text: ``
    },
    {
      id: '5c03ad1fe9014b21b8b1a021e93069c3',
      text: ``
    },
    {
      id: 'd63cd9f7b3994ffba4ea987b65d85f82',
      text: ``
    },
    {
      id: 'ac5c607ff2a841cf8cbf7ff55ce5c522',
      text: ``
    },
    {
      id: 'c496d1d136294133b26089c8d22abc8d',
      text: ``
    },
    {
      id: '8a1ddee94b3d4fb4b5605628ec7bb390',
      text: ``
    },
    {
      id: '9a028a7d0b16496d9ae748b3050c645f',
      text: ``
    },
    {
      id: '761cc9d6b4914042874eb6f011f62e3c',
      text: ``
    },
    {
      id: '5ee014568c9240789e591688e96dcb64',
      text: ``
    },
    {
      id: 'f59369028799477da165d24d8d310c6f',
      text: ``
    },
    {
      id: 'add36fd425a24f9fb051815fae377561',
      text: ``
    },
    {
      id: 'ea970413cdc34c458f30c90a096055c2',
      text: ``
    },
    {
      id: '3224eb120d274e0387991f9292bf6a27',
      text: ``
    },
    {
      id: '5ffe9f78c42c4434be8f9e77d9b5ff2c',
      text: ``
    },
    {
      id: '596484f2c4184dc3913cbc4ebc1e6fc2',
      text: ``
    },
    {
      id: '1a9816da26194f5c8fced97959a289eb',
      text: ``
    },
    {
      id: '5ce750a6570f4e21a6ab7cba47af7653',
      text: `Life is not what you alone make it. Life is the input of everyone who touched your life and every experience that entered it. We are all part of one another. – Yuri Kochiyama`
    },
    {
      id: '',
      text: ``
    }
  ],
  "gr": [

  ]
}